dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l051_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L051_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L051_PINMUX_H_)
# define _STM32L051_PINMUX_H_

#define COMP1_OUT_FUNC           0
#define COMP2_OUT_FUNC           1
#define CRS_SYNC_FUNC            2
#define EVENTOUT_FUNC            3
#define I2C1_SCL_FUNC            4
#define I2C1_SDA_FUNC            5
#define I2C1_SMBA_FUNC           6
#define I2C2_SCL_FUNC            7
#define I2C2_SDA_FUNC            8
#define I2C2_SMBA_FUNC           9
#define I2S2_CK_FUNC             10
#define I2S2_MCK_FUNC            11
#define I2S2_SD_FUNC             12
#define I2S2_WS_FUNC             13
#define LCD_COM0_FUNC            14
#define LCD_COM1_FUNC            15
#define LCD_COM2_FUNC            16
#define LCD_COM3_FUNC            17
#define LCD_COM4_FUNC            18
#define LCD_COM5_FUNC            19
#define LCD_COM6_FUNC            20
#define LCD_COM7_FUNC            21
#define LCD_SEG0_FUNC            22
#define LCD_SEG1_FUNC            23
#define LCD_SEG10_FUNC           24
#define LCD_SEG11_FUNC           25
#define LCD_SEG12_FUNC           26
#define LCD_SEG13_FUNC           27
#define LCD_SEG14_FUNC           28
#define LCD_SEG15_FUNC           29
#define LCD_SEG16_FUNC           30
#define LCD_SEG17_FUNC           31
#define LCD_SEG18_FUNC           32
#define LCD_SEG19_FUNC           33
#define LCD_SEG2_FUNC            34
#define LCD_SEG20_FUNC           35
#define LCD_SEG21_FUNC           36
#define LCD_SEG22_FUNC           37
#define LCD_SEG23_FUNC           38
#define LCD_SEG24_FUNC           39
#define LCD_SEG25_FUNC           40
#define LCD_SEG26_FUNC           41
#define LCD_SEG27_FUNC           42
#define LCD_SEG28_FUNC           43
#define LCD_SEG29_FUNC           44
#define LCD_SEG3_FUNC            45
#define LCD_SEG30_FUNC           46
#define LCD_SEG31_FUNC           47
#define LCD_SEG4_FUNC            48
#define LCD_SEG40_FUNC           49
#define LCD_SEG41_FUNC           50
#define LCD_SEG42_FUNC           51
#define LCD_SEG43_FUNC           52
#define LCD_SEG5_FUNC            53
#define LCD_SEG6_FUNC            54
#define LCD_SEG7_FUNC            55
#define LCD_SEG8_FUNC            56
#define LCD_SEG9_FUNC            57
#define LPTIM1_ETR_FUNC          58
#define LPTIM1_IN1_FUNC          59
#define LPTIM1_IN2_FUNC          60
#define LPTIM1_OUT_FUNC          61
#define LPUART1_CTS_FUNC         62
#define LPUART1_DE_FUNC          63
#define LPUART1_RTS_FUNC         64
#define LPUART1_RX_FUNC          65
#define LPUART1_TX_FUNC          66
#define RCC_MCO_FUNC             67
#define RTC_OUT_ALARM_FUNC       68
#define RTC_OUT_CALIB_FUNC       69
#define RTC_REFIN_FUNC           70
#define SPI1_MISO_FUNC           71
#define SPI1_MOSI_FUNC           72
#define SPI1_NSS_FUNC            73
#define SPI1_SCK_FUNC            74
#define SPI2_MISO_FUNC           75
#define SPI2_MOSI_FUNC           76
#define SPI2_NSS_FUNC            77
#define SPI2_SCK_FUNC            78
#define SYS_SWCLK_FUNC           79
#define SYS_SWDIO_FUNC           80
#define TIM21_CH1_FUNC           81
#define TIM21_CH2_FUNC           82
#define TIM21_ETR_FUNC           83
#define TIM22_CH1_FUNC           84
#define TIM22_CH2_FUNC           85
#define TIM22_ETR_FUNC           86
#define TIM2_CH1_FUNC            87
#define TIM2_CH2_FUNC            88
#define TIM2_CH3_FUNC            89
#define TIM2_CH4_FUNC            90
#define TIM2_ETR_FUNC            91
#define TSC_G1_IO1_FUNC          92
#define TSC_G1_IO2_FUNC          93
#define TSC_G1_IO3_FUNC          94
#define TSC_G1_IO4_FUNC          95
#define TSC_G2_IO1_FUNC          96
#define TSC_G2_IO2_FUNC          97
#define TSC_G2_IO3_FUNC          98
#define TSC_G2_IO4_FUNC          99
#define TSC_G3_IO1_FUNC          100
#define TSC_G3_IO2_FUNC          101
#define TSC_G3_IO3_FUNC          102
#define TSC_G3_IO4_FUNC          103
#define TSC_G4_IO1_FUNC          104
#define TSC_G4_IO2_FUNC          105
#define TSC_G4_IO3_FUNC          106
#define TSC_G4_IO4_FUNC          107
#define TSC_G5_IO1_FUNC          108
#define TSC_G5_IO2_FUNC          109
#define TSC_G5_IO3_FUNC          110
#define TSC_G5_IO4_FUNC          111
#define TSC_G6_IO1_FUNC          112
#define TSC_G6_IO2_FUNC          113
#define TSC_G6_IO3_FUNC          114
#define TSC_G6_IO4_FUNC          115
#define TSC_G7_IO1_FUNC          116
#define TSC_G7_IO2_FUNC          117
#define TSC_G7_IO3_FUNC          118
#define TSC_G7_IO4_FUNC          119
#define TSC_G8_IO1_FUNC          120
#define TSC_G8_IO2_FUNC          121
#define TSC_G8_IO3_FUNC          122
#define TSC_G8_IO4_FUNC          123
#define TSC_SYNC_FUNC            124
#define USART1_CK_FUNC           125
#define UART1_CK_FUNC            125
#define USART1_CTS_FUNC          126
#define UART1_CTS_FUNC           126
#define USART1_DE_FUNC           127
#define UART1_DE_FUNC            127
#define USART1_RTS_FUNC          128
#define UART1_RTS_FUNC           128
#define USART1_RX_FUNC           129
#define UART1_RX_FUNC            129
#define USART1_TX_FUNC           130
#define UART1_TX_FUNC            130
#define USART2_CK_FUNC           131
#define UART2_CK_FUNC            131
#define USART2_CTS_FUNC          132
#define UART2_CTS_FUNC           132
#define USART2_DE_FUNC           133
#define UART2_DE_FUNC            133
#define USART2_RTS_FUNC          134
#define UART2_RTS_FUNC           134
#define USART2_RX_FUNC           135
#define UART2_RX_FUNC            135
#define USART2_TX_FUNC           136
#define UART2_TX_FUNC            136
#define USB_NOE_FUNC             137

# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TSC_G1_IO1_FUNC          )) ?  3 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  4 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  5 : \
	((gpio == PA00) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PA01) && (func == LCD_SEG0_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == TSC_G1_IO2_FUNC          )) ?  3 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  4 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  4 : \
	((gpio == PA01) && (func == TIM21_ETR_FUNC           )) ?  5 : \
	((gpio == PA02) && (func == TIM21_CH1_FUNC           )) ?  0 : \
	((gpio == PA02) && (func == LCD_SEG1_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == TSC_G1_IO3_FUNC          )) ?  3 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  4 : \
	((gpio == PA02) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == TIM21_CH2_FUNC           )) ?  0 : \
	((gpio == PA03) && (func == LCD_SEG2_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == TSC_G1_IO4_FUNC          )) ?  3 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  4 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  0 : \
	((gpio == PA04) && (func == TSC_G2_IO1_FUNC          )) ?  3 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  4 : \
	((gpio == PA04) && (func == TIM22_ETR_FUNC           )) ?  5 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  0 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == TSC_G2_IO2_FUNC          )) ?  3 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  5 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PA06) && (func == LCD_SEG3_FUNC            )) ?  1 : \
	((gpio == PA06) && (func == TSC_G2_IO3_FUNC          )) ?  3 : \
	((gpio == PA06) && (func == LPUART1_CTS_FUNC         )) ?  4 : \
	((gpio == PA06) && (func == TIM22_CH1_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PA06) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PA07) && (func == LCD_SEG4_FUNC            )) ?  1 : \
	((gpio == PA07) && (func == TSC_G2_IO4_FUNC          )) ?  3 : \
	((gpio == PA07) && (func == TIM22_CH2_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PA07) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == LCD_COM0_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == CRS_SYNC_FUNC            )) ?  2 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  4 : \
	((gpio == PA09) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA09) && (func == LCD_COM1_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == TSC_G4_IO1_FUNC          )) ?  3 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  4 : \
	((gpio == PA10) && (func == LCD_COM2_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == TSC_G4_IO2_FUNC          )) ?  3 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  4 : \
	((gpio == PA11) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PA11) && (func == TSC_G4_IO3_FUNC          )) ?  3 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  4 : \
	((gpio == PA11) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PA12) && (func == TSC_G4_IO4_FUNC          )) ?  3 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  4 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  4 : \
	((gpio == PA12) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA13) && (func == SYS_SWDIO_FUNC           )) ?  0 : \
	((gpio == PA13) && (func == USB_NOE_FUNC             )) ?  2 : \
	((gpio == PA14) && (func == SYS_SWCLK_FUNC           )) ?  0 : \
	((gpio == PA14) && (func == USART2_TX_FUNC           )) ?  4 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == LCD_SEG17_FUNC           )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PA15) && (func == USART2_RX_FUNC           )) ?  4 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  5 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PB00) && (func == LCD_SEG5_FUNC            )) ?  1 : \
	((gpio == PB00) && (func == TSC_G3_IO2_FUNC          )) ?  3 : \
	((gpio == PB01) && (func == LCD_SEG6_FUNC            )) ?  1 : \
	((gpio == PB01) && (func == TSC_G3_IO3_FUNC          )) ?  3 : \
	((gpio == PB01) && (func == LPUART1_DE_FUNC          )) ?  4 : \
	((gpio == PB01) && (func == LPUART1_RTS_FUNC         )) ?  4 : \
	((gpio == PB02) && (func == LPTIM1_OUT_FUNC          )) ?  2 : \
	((gpio == PB02) && (func == TSC_G3_IO4_FUNC          )) ?  3 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  0 : \
	((gpio == PB03) && (func == LCD_SEG7_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PB03) && (func == TSC_G5_IO1_FUNC          )) ?  3 : \
	((gpio == PB03) && (func == EVENTOUT_FUNC            )) ?  4 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == LCD_SEG8_FUNC            )) ?  1 : \
	((gpio == PB04) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == TSC_G5_IO2_FUNC          )) ?  3 : \
	((gpio == PB04) && (func == TIM22_CH1_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PB05) && (func == LCD_SEG9_FUNC            )) ?  1 : \
	((gpio == PB05) && (func == LPTIM1_IN1_FUNC          )) ?  2 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  3 : \
	((gpio == PB05) && (func == TIM22_CH2_FUNC           )) ?  4 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  0 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  1 : \
	((gpio == PB06) && (func == LPTIM1_ETR_FUNC          )) ?  2 : \
	((gpio == PB06) && (func == TSC_G5_IO3_FUNC          )) ?  3 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  0 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  1 : \
	((gpio == PB07) && (func == LPTIM1_IN2_FUNC          )) ?  2 : \
	((gpio == PB07) && (func == TSC_G5_IO4_FUNC          )) ?  3 : \
	((gpio == PB08) && (func == LCD_SEG16_FUNC           )) ?  1 : \
	((gpio == PB08) && (func == TSC_SYNC_FUNC            )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == LCD_COM3_FUNC            )) ?  1 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == LCD_SEG10_FUNC           )) ?  1 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PB10) && (func == TSC_SYNC_FUNC            )) ?  3 : \
	((gpio == PB10) && (func == LPUART1_TX_FUNC          )) ?  4 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  6 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PB11) && (func == LCD_SEG11_FUNC           )) ?  1 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PB11) && (func == TSC_G6_IO1_FUNC          )) ?  3 : \
	((gpio == PB11) && (func == LPUART1_RX_FUNC          )) ?  4 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  6 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  0 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  0 : \
	((gpio == PB12) && (func == LCD_SEG12_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == LPUART1_DE_FUNC          )) ?  2 : \
	((gpio == PB12) && (func == LPUART1_RTS_FUNC         )) ?  2 : \
	((gpio == PB12) && (func == TSC_G6_IO2_FUNC          )) ?  3 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  5 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  0 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  0 : \
	((gpio == PB13) && (func == LCD_SEG13_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == TSC_G6_IO3_FUNC          )) ?  3 : \
	((gpio == PB13) && (func == LPUART1_CTS_FUNC         )) ?  4 : \
	((gpio == PB13) && (func == I2C2_SCL_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == TIM21_CH1_FUNC           )) ?  6 : \
	((gpio == PB14) && (func == I2S2_MCK_FUNC            )) ?  0 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  0 : \
	((gpio == PB14) && (func == LCD_SEG14_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == RTC_OUT_ALARM_FUNC       )) ?  2 : \
	((gpio == PB14) && (func == RTC_OUT_CALIB_FUNC       )) ?  2 : \
	((gpio == PB14) && (func == TSC_G6_IO4_FUNC          )) ?  3 : \
	((gpio == PB14) && (func == LPUART1_DE_FUNC          )) ?  4 : \
	((gpio == PB14) && (func == LPUART1_RTS_FUNC         )) ?  4 : \
	((gpio == PB14) && (func == I2C2_SDA_FUNC            )) ?  5 : \
	((gpio == PB14) && (func == TIM21_CH2_FUNC           )) ?  6 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  0 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == LCD_SEG15_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  2 : \
	((gpio == PC00) && (func == LPTIM1_IN1_FUNC          )) ?  0 : \
	((gpio == PC00) && (func == LCD_SEG18_FUNC           )) ?  1 : \
	((gpio == PC00) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PC00) && (func == TSC_G7_IO1_FUNC          )) ?  3 : \
	((gpio == PC01) && (func == LPTIM1_OUT_FUNC          )) ?  0 : \
	((gpio == PC01) && (func == LCD_SEG19_FUNC           )) ?  1 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PC01) && (func == TSC_G7_IO2_FUNC          )) ?  3 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  0 : \
	((gpio == PC02) && (func == LCD_SEG20_FUNC           )) ?  1 : \
	((gpio == PC02) && (func == I2S2_MCK_FUNC            )) ?  2 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  2 : \
	((gpio == PC02) && (func == TSC_G7_IO3_FUNC          )) ?  3 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  0 : \
	((gpio == PC03) && (func == LCD_SEG21_FUNC           )) ?  1 : \
	((gpio == PC03) && (func == I2S2_SD_FUNC             )) ?  2 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  2 : \
	((gpio == PC03) && (func == TSC_G7_IO4_FUNC          )) ?  3 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC04) && (func == LCD_SEG22_FUNC           )) ?  1 : \
	((gpio == PC04) && (func == LPUART1_TX_FUNC          )) ?  2 : \
	((gpio == PC05) && (func == LCD_SEG23_FUNC           )) ?  1 : \
	((gpio == PC05) && (func == LPUART1_RX_FUNC          )) ?  2 : \
	((gpio == PC05) && (func == TSC_G3_IO1_FUNC          )) ?  3 : \
	((gpio == PC06) && (func == TIM22_CH1_FUNC           )) ?  0 : \
	((gpio == PC06) && (func == LCD_SEG24_FUNC           )) ?  1 : \
	((gpio == PC06) && (func == TSC_G8_IO1_FUNC          )) ?  3 : \
	((gpio == PC07) && (func == TIM22_CH2_FUNC           )) ?  0 : \
	((gpio == PC07) && (func == LCD_SEG25_FUNC           )) ?  1 : \
	((gpio == PC07) && (func == TSC_G8_IO2_FUNC          )) ?  3 : \
	((gpio == PC08) && (func == TIM22_ETR_FUNC           )) ?  0 : \
	((gpio == PC08) && (func == LCD_SEG26_FUNC           )) ?  1 : \
	((gpio == PC08) && (func == TSC_G8_IO3_FUNC          )) ?  3 : \
	((gpio == PC09) && (func == TIM21_ETR_FUNC           )) ?  0 : \
	((gpio == PC09) && (func == LCD_SEG27_FUNC           )) ?  1 : \
	((gpio == PC09) && (func == USB_NOE_FUNC             )) ?  2 : \
	((gpio == PC09) && (func == TSC_G8_IO4_FUNC          )) ?  3 : \
	((gpio == PC10) && (func == LPUART1_TX_FUNC          )) ?  0 : \
	((gpio == PC10) && (func == LCD_COM4_FUNC            )) ?  1 : \
	((gpio == PC10) && (func == LCD_SEG28_FUNC           )) ?  1 : \
	((gpio == PC10) && (func == LCD_SEG40_FUNC           )) ?  1 : \
	((gpio == PC11) && (func == LPUART1_RX_FUNC          )) ?  0 : \
	((gpio == PC11) && (func == LCD_COM5_FUNC            )) ?  1 : \
	((gpio == PC11) && (func == LCD_SEG29_FUNC           )) ?  1 : \
	((gpio == PC11) && (func == LCD_SEG41_FUNC           )) ?  1 : \
	((gpio == PC12) && (func == LCD_COM6_FUNC            )) ?  1 : \
	((gpio == PC12) && (func == LCD_SEG30_FUNC           )) ?  1 : \
	((gpio == PC12) && (func == LCD_SEG42_FUNC           )) ?  1 : \
	((gpio == PD02) && (func == LPUART1_DE_FUNC          )) ?  0 : \
	((gpio == PD02) && (func == LPUART1_RTS_FUNC         )) ?  0 : \
	((gpio == PD02) && (func == LCD_COM7_FUNC            )) ?  1 : \
	((gpio == PD02) && (func == LCD_SEG31_FUNC           )) ?  1 : \
	((gpio == PD02) && (func == LCD_SEG43_FUNC           )) ?  1 : \
	((gpio == PH00) && (func == CRS_SYNC_FUNC            )) ?  0 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA02) && (timer_nr == 21) && (channel_nr ==  1)) ?  0 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA03) && (timer_nr == 21) && (channel_nr ==  2)) ?  0 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  5 : \
	((gpio == PA06) && (timer_nr == 22) && (channel_nr ==  1)) ?  5 : \
	((gpio == PA07) && (timer_nr == 22) && (channel_nr ==  2)) ?  5 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  5 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB04) && (timer_nr == 22) && (channel_nr ==  1)) ?  4 : \
	((gpio == PB05) && (timer_nr == 22) && (channel_nr ==  2)) ?  4 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB13) && (timer_nr == 21) && (channel_nr ==  1)) ?  6 : \
	((gpio == PB14) && (timer_nr == 21) && (channel_nr ==  2)) ?  6 : \
	((gpio == PC06) && (timer_nr == 22) && (channel_nr ==  1)) ?  0 : \
	((gpio == PC07) && (timer_nr == 22) && (channel_nr ==  2)) ?  0 : \
	AF_NO_SUCH_PINFUNC)
#endif
